tutorials/compressible/rhoCentralFoam/biconic25-55Run35/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar>
32385
(
712.138266350232
808.562545389019
824.650592078926
826.888801039072
826.337948523676
824.581635219359
823.590276244624
822.692900760277
...
)
;

boundaryField
{
    cone
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    freestream
    {
        type            fixedValue;
        value           uniform 22.74;
    }
    centreLeft
    {
        type            symmetryPlane;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}

// ************************************************************************* //
